{
  "architectures": [
    "EfficientNetForImageClassification"
  ],
  "batch_norm_eps": 0.001,
  "batch_norm_momentum": 0.99,
  "depth_coefficient": 1.2,
  "depth_divisor": 8,
  "depthwise_padding": [
    5,
    8,
    16
  ],
  "drop_connect_rate": 0.2,
  "dropout_rate": 0.3,
  "dtype": "float32",
  "expand_ratios": [
    1,
    6,
    6,
    6,
    6,
    6,
    6
  ],
  "hidden_act": "swish",
  "hidden_dim": 1408,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2"
  },
  "image_size": 260,
  "in_channels": [
    32,
    16,
    24,
    40,
    80,
    112,
    192
  ],
  "initializer_range": 0.02,
  "kernel_sizes": [
    3,
    3,
    5,
    3,
    5,
    5,
    3
  ],
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_2": 2
  },
  "model_type": "efficientnet",
  "num_block_repeats": [
    1,
    2,
    2,
    3,
    3,
    4,
    1
  ],
  "num_channels": 3,
  "num_hidden_layers": 64,
  "out_channels": [
    16,
    24,
    40,
    80,
    112,
    192,
    320
  ],
  "pooling_type": "mean",
  "problem_type": "single_label_classification",
  "squeeze_expansion_ratio": 0.25,
  "strides": [
    1,
    2,
    2,
    2,
    1,
    2,
    1
  ],
  "transformers_version": "5.0.0",
  "use_cache": false,
  "width_coefficient": 1.1
}
